/*
С клавиатуры вводится двумерный массив, длина его строк – 4, столбцов – 3.

1. Напишите программу, которая выводит номера строк и суммы их элементов (пример: Line 2: 17).
2. Напишите программу, которая выводит номера столбцов и суммы их элементов (пример: Column 3: 21).
3. Напишите программу, которая заменяет все нечётные элементы массива на 1, а чётные на 0 и выводит его на экран.
4. Напишите программу, которая в каждой строке находит целое среднее арифметическое и выводит его на экран.

5.***Напишите программу, которая преобразует двумерный массив в перевёрнутый одномерный и выводит все элементы одномерного массива на экран.
 */
public class Iteco {
    public static void main (String[] args) {
        Lesson3.displaysNameAndSumNumber();
    }
}
